{
  "auto_mapping": {
    "base_model_class": "WhisperForConditionalGeneration",
    "parent_library": "transformers.models.whisper.modeling_whisper"
  },
  "base_model_name_or_path": "openai/whisper-large-v2",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 64,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "revision": null,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": null
}